Repository: Blezz-tech/kp11-conspects
Catalog: src/src-omegat.tmx
Source language: en_us
Languages: ru_ru

source: When I was starting out in Haskell, I didn't learn from just one resource.
ru_ru: Когда я начинал изучать Haskell, я учился на нескольких ресурсах.

source: When a function doesn't take any parameters, we usually say it's a _definition_ (or a _name_).
ru_ru: Когда функция не принимает никаких параметров, мы обычно говорим, что это _определение_ (или _имя_^[Честно говоря не знаю как правильнее в данном случае перевести слово name]).

source: When drawing from several lists, comprehensions produce all combinations of the given lists and then join them by the output function we supply.
ru_ru: При рисовании из нескольких списковых включений создает все комбинации заданных списков, а затем объединяет их с помощью функции вывода, которую мы предоставляем.

source: When using `<`, `<=`, `>` and `>=` to compare lists, they are compared in lexicographical order.
ru_ru: При использовании `<`, `<=`, `>` и `>=` для сравнения списков они сравниваются в лексикографическом порядке.

source: When using `head`, `tail`, `last` and `init`, be careful not to use them on empty lists.
ru_ru: При использовании `head`, `tail`, `last` и `init` будьте осторожны и не используйте их в пустых списках.

source: When you compile your program, the compiler knows which piece of code is a number, which is a string and so on.
ru_ru: Когда вы компилируете свою программу, компилятор знает, какой фрагмент кода является числом, который - строкой и так далее.

source: When you put together two lists (even if you append a singleton list to a list, for instance: `[1,2,3] ++ [4]`), internally, Haskell has to walk through the whole list on the left side of `++`.
ru_ru: Когда вы объединяете два списка (даже если вы добавляете одноэлементный список к списку, например: `[1,2,3] ++ [4]`), внутренне Haskell должен просмотреть весь список в левой части `++`.

source: Whereas `+` works only on things that are considered numbers, `==` works on any two things that can be compared.
ru_ru: В то время как `+` работает только с теми вещами, которые считаются числами, `==` работает с любыми двумя вещами, которые можно сравнить.

source: While executing them, it can change state.
ru_ru: Во время их выполнения он может изменять состояние.

source: While pretty smart, ranges with steps aren't as smart as some people expect them to be.
ru_ru: Несмотря на то, что диапазоны со ступенями довольно умны, они не так умны, как некоторые люди ожидают от них.

source: While there are singleton lists, there's no such thing as a singleton tuple.
ru_ru: Хотя существуют одноэлементные списки, такого понятия, как одноэлементный кортеж, не существует.

source: With that in mind, we could redefine `doubleUs` like this:
ru_ru: Имея это в виду, мы могли бы переопределить `doubleUs` следующим образом:

source: Work on Haskell began in 1987 when a committee of researchers got together to design a kick-ass language.
ru_ru: Работа над Haskell началась в 1987 году, когда комитет исследователей собрался вместе для разработки потрясающего языка.

source: Yeah, I know it's not but bear with me.
ru_ru: Да, я знаю, что это не так, но потерпи меня.

source: Yikes!
ru_ru: Черт возьми!

source: You also can't set a variable to something and then set it to something else later.
ru_ru: Вы также не можете присвоить переменной значение чего-то, а затем присвоить ей значение чего-то другого позже.

source: You also couldn't make a list like `[(1,2),("One",2)]` because the first element of the list is a pair of numbers and the second element is a pair consisting of a string and a number.
ru_ru: Вы также не смогли бы составить список типа `[(1,2),("Один",2)]`, потому что первый элемент списка - это пара чисел, а второй элемент - это пара, состоящая из строки и числа.

source: You can also use ranges to make infinite lists by just not specifying an upper limit.
ru_ru: Вы также можете использовать диапазоны для создания бесконечных списков, просто не указывая верхний предел.

source: You can call functions from scripts that you load and the results are displayed immediately.
ru_ru: Вы можете вызывать функции из скриптов, которые вы загружаете, и результаты отображаются немедленно.

source: You can write list comprehensions across several lines.
ru_ru: Вы можете написать списковое включение в нескольких строках.

source: You can't compare apples and oranges.
ru_ru: Вы не можете сравнивать яблоки и апельсины.

source: You can't do `[1,2,4,8,16..100]` and expect to get all the powers of 2.
ru_ru: Вы не можете выполнить `[1,2,4,8,16..100]` и ожидать, что получите все степени 2.

source: You could just redefine `doubleMe` to be `x + x + x` and since `doubleUs` calls `doubleMe`, it would automatically work in this strange new world where 2 is 3.
ru_ru: Вы могли бы просто переопределить `doubleMe` на `x + x + x`, и поскольку `doubleUs` вызывает `doubleMe`, это автоматически сработало бы в этом странном новом мире, где 2 равно 3.

source: You express that in the form of functions.
ru_ru: Вы выражаете это в форме функций.

source: You have control flow structures for doing some action several times.
ru_ru: У вас есть структуры потока управления для выполнения какого-либо действия несколько раз.

source: You may not have known it but we've been using functions now all along.
ru_ru: Возможно, вы этого не знали, но мы все это время использовали функции.

source: You probably already have your favorite text editor installed so we won't waste time on that.
ru_ru: Вероятно, у вас уже установлен ваш любимый текстовый редактор, так что мы не будем тратить на это время.

source: You take a starting set of solutions and then you apply transformations to those solutions and filter them until you get the right ones.
ru_ru: Вы берете начальный набор решений, а затем применяете преобразования к этим решениям и фильтруете их до тех пор, пока не получите правильные.

source: You will be greeted with something like this.
ru_ru: Вас встретят чем-то вроде этого.

source: You're probably familiar with if statements from other languages.
ru_ru: Вероятно, вы знакомы с операторами `if` из других языков.

source: `"hello"` is just syntactic sugar for `['h','e','l','l','o']`.
ru_ru: `"hello"` - это просто синтаксический сахар для `['h','e','l','l','o']`.

source: `+` expects its left and right side to be numbers.
ru_ru: `+` ожидает, что его левая и правая стороны будут числами.

source: `4.0` can't act like an integer, so `5` is the one that has to adapt.
ru_ru: `4.0` не может действовать как целое число, поэтому `5` - это то, что должно адаптироваться.

source: `5` is an expression because it returns 5, `4 + 8` is an expression, `x + y` is an expression because it returns the sum of `x` and `y`.
ru_ru: `5` - это выражение, потому что оно возвращает 5, `4 + 8` - это выражение, `x + y` - это выражение, потому что оно возвращает сумму `x` и `y`.

source: `[1,2,3]` is actually just syntactic sugar for `1:2:3:[]`.
ru_ru: `[1,2,3]` на самом деле является просто синтаксическим сахаром для `1:2:3:[]`.

source: `[]` is an empty list.
ru_ru: `[]` - это пустой список.

source: `_` means that we don't care what we'll draw from the list anyway so instead of writing a variable name that we'll never use, we just write `_`.
ru_ru: `_` означает, что нам все равно, что мы будем извлекать из списка, поэтому вместо того, чтобы писать имя переменной, которое мы никогда не будем использовать, мы просто пишем `_`.

source: ```haskell ghci> [ x | x <- [10..20], x /= 13, x /= 15, x /= 19] [10,11,12,14,16,17,18,20] ```
ru_ru: ghci> [ x | x <- [10..20], x /= 13, x /= 15, x /= 19]

source: `cycle` takes a list and cycles it into an infinite list.
ru_ru: `cycle` берет список и преобразует его в бесконечный список.

source: `drop` works in a similar way, only it drops the number of elements from the beginning of a list.
ru_ru: `drop` работает аналогичным образом, только он уменьшает количество элементов из начала списка.

source: `elem` takes a thing and a list of things and tells us if that thing is an element of the list.
ru_ru: `elem` берет вещь и список вещей и сообщает нам, является ли эта вещь элементом списка.

source: `fst` takes a pair and returns its first component.
ru_ru: `fst` принимает пару и возвращает ее первый компонент.

source: `head` takes a list and returns its head.
ru_ru: `head` принимает список и возвращает его заголовок.

source: `init` takes a list and returns everything except its last element.
ru_ru: `init` принимает список и возвращает все, кроме его последнего элемента.

source: `last` takes a list and returns its last element.
ru_ru: `last` принимает список и возвращает его последний элемент.

source: `length` takes a list and returns its length, obviously.
ru_ru: очевидно, что `length` принимает список и возвращает его длину.

source: `maximum` takes a list of stuff that can be put in some kind of order and returns the biggest element.
ru_ru: `maximum` принимает список элементов, которые можно расположить в определенном порядке, и возвращает самый большой элемент.

source: `min` returns the one that's lesser and `max` returns the one that's greater.
ru_ru: `min` возвращает значение, которое меньше, а `max` возвращает значение, которое больше.

source: `minimum` returns the smallest.
ru_ru: `minimum` возвращает наименьшее значение.

source: `not` negates a `True` or a `False`.
ru_ru: `not` отрицает `True` или `False`.

source: `null` checks if a list is empty.
ru_ru: `null` проверяет, пуст ли список.

source: `product` takes a list of numbers and returns their product.
ru_ru: `product` принимает список чисел и возвращает их произведение.

source: `repeat` takes an element and produces an infinite list of just that element.
ru_ru: `repeat` принимает элемент и создает бесконечный список только этого элемента.

source: `replicate 3 10` returns `[10,10,10]`.
ru_ru: `replicate 3 10` возвращает `[10,10,10]`.

source: `reverse` reverses a list.
ru_ru: `reverse` переворачивает список.

source: `snd` takes a pair and returns its second component.
ru_ru: `snd` принимает пару и возвращает ее второй компонент.

source: `sum` takes a list of numbers and returns their sum.
ru_ru: `sum` принимает список чисел и возвращает их сумму.

source: `tail` takes a list and returns its tail.
ru_ru: `tail` принимает список и возвращает его хвост.

source: `take` takes number and a list.
ru_ru: `take` принимает номер и список.

source: `x` is drawn from `[1..10]` and for every element in `[1..10]` (which we have bound to `x`), we get that element, only doubled.
ru_ru: `x` берется из `[1..10]`, и для каждого элемента в `[1..10]` (который мы привязали к `x`) мы получаем этот элемент, только удвоенный.
